__author__ = 'Denisova E.'
#Вычислить произведение i^2/(i^2 + 2i + 3) при i = [1,n]

r = 1.0

n = int(input("Введите целое число: "))

#вычисление выражения по формуле
for i in range (1,n+1):
	r *= (i * i) / (i * i + 2 * i + 3)

print (f"Произведение: {r:.8f}")


