__author__ = 'Denisova E.'
# Определить, является ли данное целое число четным.

a = int(input("Введите целое число: "))

if a%2 == 0 :
	print ("Число чётное")
else:
	print ("Число нечётное")


